Core/src/src/Documents/ПеремещениеВА/ПеремещениеВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВА</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.СостоянияВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.УчетПоПроектамВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТН</name>
    <type>
      <types>EnumRef.РС_СтатусыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиницаПолучатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектПолучатель</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РыночнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПеремещенияВА</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/ПараметрыВнеоборотныхАктивов/ПараметрыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВнеоборотныхАктивов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <comment>Срок использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/РыночныеЦеныВА/РыночныеЦеныВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РыночныеЦеныВА</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Имущество</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/СпособыНачисленияАмортизацииВнеоборотныхАктивов/СпособыНачисленияАмортизацииВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияАмортизацииВнеоборотныхАктивов</name>
  <enumValues>
    <name>Линейный</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъемуПродукции</name>
  </enumValues>
  <enumValues>
    <name>УменьшенногоОстатка</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/ПеремещениеВА/ObjectModule.bsl
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг

//29.07.2025 ONESOFT-4150
Процедура ЗаполнитьПоИнвентаризацииОсновныхСредств(ДокументСсылкаИнвентаризацияОсновныхСредств) Экспорт
	
	// Заполнение шапки документа.
	ДокументОснование = ДокументСсылкаИнвентаризацияОсновныхСредств.Ссылка;
	Организация = ДокументСсылкаИнвентаризацияОсновныхСредств.Организация;
	
	// Заполнение табличной части документа.
	Для каждого СтрокаТабличнойЧасти Из ДокументСсылкаИнвентаризацияОсновныхСредств.ВнеоборотныеАктивы Цикл
		
		Если СтрокаТабличнойЧасти.Отклонение < 0 Тогда
			НоваяСтрока = ВнеоборотныеАктивы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);   
						
			ЗаполнитьДанныеВА(НоваяСтрока);
			
			НоваяСтрока.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = СтрокаТабличнойЧасти.ВнеоборотныйАктив.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка;   
			НоваяСтрока.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = СтрокаТабличнойЧасти.ВнеоборотныйАктив.ГодовойПроцентАмортизацииДляУменьшенногоОстатка;    		
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьДанныеВА(НоваяСтрока)
	
	ДатаЗапроса = Дата(1,1,1);
	Если ЗначениеЗаполнено(Дата) Тогда 
		Если Дата = НачалоДня(Дата) Тогда 
			ДатаЗапроса = ТекущаяДата();
		Иначе
			ДатаЗапроса = Дата-1;
		КонецЕсли;
	Иначе
		ДатаЗапроса = ТекущаяДата();
	КонецЕсли;
		
	Если НоваяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктивТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПолучатель,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ПараметрыАмортизацииСрезПоследних.Адрес КАК Адрес,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПараметрыАмортизацииСрезПоследних.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПараметрыАмортизацииСрезПоследних.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	|	ЕСТЬNULL(СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизацию, ЛОЖЬ) КАК Амортизация,
	|	ЕСТЬNULL(СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизациюВТекущемМесяце, ЛОЖЬ) КАК НачислятьАмортизациюВТекущемМесяце,
	|	ЕСТЬNULL(РыночныеЦеныВАСрезПоследних.Цена, 0) КАК РыночнаяЦена
	|ИЗ
	|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(
	|			&ДатаДокумента,
	|			Организация = &Организация
	|				И ВнеоборотныйАктив = &ВнеоборотныйАктив
	|				И НЕ Регистратор = &Ссылка
	|) КАК ПараметрыАмортизацииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(
	|				&ДатаДокумента,
	|				Организация = &Организация
	|					И ВнеоборотныйАктив = &ВнеоборотныйАктив
	|					И НЕ Регистратор = &Ссылка) КАК СостоянияВнеоборотныхАктивовСрезПоследних
	|		ПО ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив = СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РыночныеЦеныВА.СрезПоследних(&ДатаДокумента, ) КАК РыночныеЦеныВАСрезПоследних
	|		ПО ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив = РыночныеЦеныВАСрезПоследних.Имущество";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", НоваяСтрока.ВнеоборотныйАктив);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(НоваяСтрока ,ВыборкаРезультат);
	КонецЦикла;
	
	НоваяСтрока.Проект = Справочники.Проекты.ПустаяСсылка();
	НоваяСтрока.ПроектПолучатель = Справочники.Проекты.ПустаяСсылка();
	
	УчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	
	Если УчетПоПроектам Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
		|	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.Проект
		|ИЗ
		|	РегистрСведений.УчетПоПроектамВнеоборотныхАктивов.СрезПоследних(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И ВнеоборотныйАктив = &ВнеоборотныйАктив) КАК УчетПоПроектамВнеоборотныхАктивовСрезПоследних";
		
		ВыборкаРезультат = Запрос.Выполнить().Выбрать();
		Пока ВыборкаРезультат.Следующий() Цикл 
			НоваяСтрока.Проект = ВыборкаРезультат.Проект;
			НоваяСтрока.ПроектПолучатель = ВыборкаРезультат.Проект;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

//&НаСервере
//Функция НайтиСкладВПринятиеКУчету(ВнеоборотныйАктив)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПринятиеКУчетуВА.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
//		|ИЗ
//		|	Документ.ПринятиеКУчетуВА КАК ПринятиеКУчетуВА
//		|ГДЕ
//		|	ПринятиеКУчетуВА.ВнеоборотныеАктивы.ВнеоборотныйАктив = &ВнеоборотныйАктив";
//	
//	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ВнеоборотныйАктив);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Возврат ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
//	КонецЦикла;
//	
//	Возврат Неопределено;	
//КонецФункции
//29.07.2025 ONESOFT-4150

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("СправочникСсылка.ВнеоборотныеАктивы")] = "ЗаполнитьПоВнеоборотныеАктивы"; 
	СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияОсновныхСредств")] = "ЗаполнитьПоИнвентаризацииОсновныхСредств";//29.07.2025 ONESOFT-4150
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
		// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПеремещениеВА.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	УправлениеНебольшойФирмойСервер.ОтразитьУчетПоПроектамВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	
	УправлениеНебольшойФирмойСервер.ОтразитьСостоянияВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) //+++ Дмгг
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныеАктивы.СчетЗатрат");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныеАктивы.СчетЗатратРегл");
	КонецЕсли;
	
	//+++ Дмгг
	Для Каждого СтрокаТЧ Из ВнеоборотныеАктивы Цикл 
		
		Если СтрокаТЧ.ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка Тогда 
			
			Если СтрокаТЧ.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = 0 Тогда 
				
				ТекстСообщения = НСтр("ka='სია ""ამორტიზაციის %"" სტრიქონ %НомерСтроки%-ში სვეტი ""ქონება"" არ არის შევსებული.';ru='Не заполнена колонка ""Годовой процент амортизации"" в строке %НомерСтроки% списка ""Имущество"".';en='Not filled column ""Annual percentage"" on line% NomerStroki% ""Propety"" list.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(СтрокаТЧ.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"ВнеоборотныеАктивы",
					СтрокаТЧ.НомерСтроки,
					"ГодовойПроцентАмортизацииДляУменьшенногоОстатка",
					Отказ
				);
			КонецЕсли;
			
			Если СтрокаТЧ.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = 0 Тогда 
				
				ТекстСообщения = НСтр("ka='სია ""სალიკვიდაციო ღირებულება"" სტრიქონ %НомерСтроки%-ში სვეტი ""ქონება"" არ არის შევსებული.';ru='Не заполнена колонка ""Ликвидационная стоимость"" в строке %НомерСтроки% списка ""Имущество"".';en='Not filled column ""Liquidation value"" on line% NomerStroki% ""Propety"" list.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(СтрокаТЧ.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"ВнеоборотныеАктивы",
					СтрокаТЧ.НомерСтроки,
					"ЛиквидационнаяСтоимостьДляУменьшенногоОстатка",
					Отказ
				);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//--- Дмгг
	
КонецПроцедуры

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг
